docs/performance/raw/20260926-a058-329/t16p20-browse200/k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/webhook-under-browse.js
        output: -

     scenarios: (100.00%) 3 scenarios, 3900 max VUs, 1m15s max duration (incl. graceful stop):
              * browse: 200.00 iterations/s for 45s (maxVUs: 300-3000, exec: browseOnce, gracefulStop: 30s)
              * hook: 10.00 iterations/s for 45s (maxVUs: 40-300, exec: webhookOnce, gracefulStop: 30s)
              * pay: 50.00 iterations/s for 45s (maxVUs: 200-600, exec: payOnce, gracefulStop: 30s)


running (0m00.9s), 0059/0540 VUs, 162 complete and 0 interrupted iterations
browse   [   2% ] 0017/0300 VUs  00.8s/45s  200.00 iters/s
hook     [   2% ] 000/040 VUs    00.8s/45s  10.00 iters/s
pay      [   2% ] 043/200 VUs    00.8s/45s  50.00 iters/s

running (0m01.9s), 0081/0540 VUs, 400 complete and 0 interrupted iterations
browse   [   4% ] 0016/0300 VUs  01.8s/45s  200.00 iters/s
hook     [   4% ] 002/040 VUs    01.8s/45s  10.00 iters/s
pay      [   4% ] 063/200 VUs    01.8s/45s  50.00 iters/s

running (0m02.9s), 0083/0540 VUs, 658 complete and 0 interrupted iterations
browse   [   6% ] 0018/0300 VUs  02.8s/45s  200.00 iters/s
hook     [   6% ] 002/040 VUs    02.8s/45s  10.00 iters/s
pay      [   6% ] 063/200 VUs    02.8s/45s  50.00 iters/s

running (0m03.9s), 0069/0540 VUs, 932 complete and 0 interrupted iterations
browse   [   9% ] 0014/0300 VUs  03.8s/45s  200.00 iters/s
hook     [   9% ] 001/040 VUs    03.8s/45s  10.00 iters/s
pay      [   9% ] 054/200 VUs    03.8s/45s  50.00 iters/s

running (0m04.9s), 0081/0540 VUs, 1180 complete and 0 interrupted iterations
browse   [  11% ] 0017/0300 VUs  04.8s/45s  200.00 iters/s
hook     [  11% ] 001/040 VUs    04.8s/45s  10.00 iters/s
pay      [  11% ] 063/200 VUs    04.8s/45s  50.00 iters/s

running (0m05.9s), 0086/0540 VUs, 1435 complete and 0 interrupted iterations
browse   [  13% ] 0015/0300 VUs  05.8s/45s  200.00 iters/s
hook     [  13% ] 002/040 VUs    05.8s/45s  10.00 iters/s
pay      [  13% ] 069/200 VUs    05.8s/45s  50.00 iters/s

running (0m06.9s), 0086/0540 VUs, 1695 complete and 0 interrupted iterations
browse   [  15% ] 0016/0300 VUs  06.8s/45s  200.00 iters/s
hook     [  15% ] 002/040 VUs    06.8s/45s  10.00 iters/s
pay      [  15% ] 068/200 VUs    06.8s/45s  50.00 iters/s

running (0m07.9s), 0094/0540 VUs, 1947 complete and 0 interrupted iterations
browse   [  17% ] 0016/0300 VUs  07.8s/45s  200.00 iters/s
hook     [  17% ] 001/040 VUs    07.8s/45s  10.00 iters/s
pay      [  17% ] 077/200 VUs    07.8s/45s  50.00 iters/s

running (0m08.9s), 0077/0540 VUs, 2225 complete and 0 interrupted iterations
browse   [  20% ] 0015/0300 VUs  08.8s/45s  200.00 iters/s
hook     [  20% ] 000/040 VUs    08.8s/45s  10.00 iters/s
pay      [  20% ] 062/200 VUs    08.8s/45s  50.00 iters/s

running (0m09.9s), 0076/0540 VUs, 2485 complete and 0 interrupted iterations
browse   [  22% ] 0016/0300 VUs  09.8s/45s  200.00 iters/s
hook     [  22% ] 001/040 VUs    09.8s/45s  10.00 iters/s
pay      [  22% ] 059/200 VUs    09.8s/45s  50.00 iters/s

running (0m10.9s), 0086/0540 VUs, 2735 complete and 0 interrupted iterations
browse   [  24% ] 0013/0300 VUs  10.8s/45s  200.00 iters/s
hook     [  24% ] 002/040 VUs    10.8s/45s  10.00 iters/s
pay      [  24% ] 071/200 VUs    10.8s/45s  50.00 iters/s

running (0m11.9s), 0072/0540 VUs, 3009 complete and 0 interrupted iterations
browse   [  26% ] 0015/0300 VUs  11.8s/45s  200.00 iters/s
hook     [  26% ] 001/040 VUs    11.8s/45s  10.00 iters/s
pay      [  26% ] 056/200 VUs    11.8s/45s  50.00 iters/s

running (0m12.9s), 0074/0540 VUs, 3267 complete and 0 interrupted iterations
browse   [  29% ] 0017/0300 VUs  12.8s/45s  200.00 iters/s
hook     [  29% ] 001/040 VUs    12.8s/45s  10.00 iters/s
pay      [  29% ] 056/200 VUs    12.8s/45s  50.00 iters/s

running (0m13.9s), 0067/0540 VUs, 3534 complete and 0 interrupted iterations
browse   [  31% ] 0013/0300 VUs  13.8s/45s  200.00 iters/s
hook     [  31% ] 000/040 VUs    13.8s/45s  10.00 iters/s
pay      [  31% ] 054/200 VUs    13.8s/45s  50.00 iters/s

running (0m14.9s), 0075/0540 VUs, 3786 complete and 0 interrupted iterations
browse   [  33% ] 0016/0300 VUs  14.8s/45s  200.00 iters/s
hook     [  33% ] 001/040 VUs    14.8s/45s  10.00 iters/s
pay      [  33% ] 058/200 VUs    14.8s/45s  50.00 iters/s

running (0m15.9s), 0081/0540 VUs, 4040 complete and 0 interrupted iterations
browse   [  35% ] 0016/0300 VUs  15.8s/45s  200.00 iters/s
hook     [  35% ] 001/040 VUs    15.8s/45s  10.00 iters/s
pay      [  35% ] 064/200 VUs    15.8s/45s  50.00 iters/s

running (0m16.9s), 0066/0540 VUs, 4315 complete and 0 interrupted iterations
browse   [  37% ] 0014/0300 VUs  16.8s/45s  200.00 iters/s
hook     [  37% ] 001/040 VUs    16.8s/45s  10.00 iters/s
pay      [  37% ] 051/200 VUs    16.8s/45s  50.00 iters/s

running (0m17.9s), 0077/0540 VUs, 4565 complete and 0 interrupted iterations
browse   [  40% ] 0017/0300 VUs  17.8s/45s  200.00 iters/s
hook     [  40% ] 001/040 VUs    17.8s/45s  10.00 iters/s
pay      [  40% ] 059/200 VUs    17.8s/45s  50.00 iters/s

running (0m18.9s), 0074/0540 VUs, 4827 complete and 0 interrupted iterations
browse   [  42% ] 0013/0300 VUs  18.8s/45s  200.00 iters/s
hook     [  42% ] 002/040 VUs    18.8s/45s  10.00 iters/s
pay      [  42% ] 059/200 VUs    18.8s/45s  50.00 iters/s

running (0m19.9s), 0077/0540 VUs, 5084 complete and 0 interrupted iterations
browse   [  44% ] 0015/0300 VUs  19.8s/45s  200.00 iters/s
hook     [  44% ] 001/040 VUs    19.8s/45s  10.00 iters/s
pay      [  44% ] 061/200 VUs    19.8s/45s  50.00 iters/s

running (0m20.9s), 0090/0540 VUs, 5331 complete and 0 interrupted iterations
browse   [  46% ] 0015/0300 VUs  20.8s/45s  200.00 iters/s
hook     [  46% ] 003/040 VUs    20.8s/45s  10.00 iters/s
pay      [  46% ] 072/200 VUs    20.8s/45s  50.00 iters/s

running (0m21.9s), 0077/0540 VUs, 5604 complete and 0 interrupted iterations
browse   [  49% ] 0016/0300 VUs  21.8s/45s  200.00 iters/s
hook     [  49% ] 002/040 VUs    21.8s/45s  10.00 iters/s
pay      [  49% ] 059/200 VUs    21.8s/45s  50.00 iters/s

running (0m22.9s), 0064/0540 VUs, 5877 complete and 0 interrupted iterations
browse   [  51% ] 0013/0300 VUs  22.8s/45s  200.00 iters/s
hook     [  51% ] 000/040 VUs    22.8s/45s  10.00 iters/s
pay      [  51% ] 051/200 VUs    22.8s/45s  50.00 iters/s

running (0m23.9s), 0067/0540 VUs, 6135 complete and 0 interrupted iterations
browse   [  53% ] 0018/0300 VUs  23.8s/45s  200.00 iters/s
hook     [  53% ] 000/040 VUs    23.8s/45s  10.00 iters/s
pay      [  53% ] 049/200 VUs    23.8s/45s  50.00 iters/s

running (0m24.9s), 0063/0540 VUs, 6398 complete and 0 interrupted iterations
browse   [  55% ] 0016/0300 VUs  24.8s/45s  200.00 iters/s
hook     [  55% ] 000/040 VUs    24.8s/45s  10.00 iters/s
pay      [  55% ] 047/200 VUs    24.8s/45s  50.00 iters/s

running (0m25.9s), 0070/0540 VUs, 6651 complete and 0 interrupted iterations
browse   [  57% ] 0016/0300 VUs  25.8s/45s  200.00 iters/s
hook     [  57% ] 001/040 VUs    25.8s/45s  10.00 iters/s
pay      [  57% ] 053/200 VUs    25.8s/45s  50.00 iters/s

running (0m26.9s), 0070/0540 VUs, 6911 complete and 0 interrupted iterations
browse   [  60% ] 0016/0300 VUs  26.8s/45s  200.00 iters/s
hook     [  60% ] 001/040 VUs    26.8s/45s  10.00 iters/s
pay      [  60% ] 053/200 VUs    26.8s/45s  50.00 iters/s

running (0m27.9s), 0063/0540 VUs, 7178 complete and 0 interrupted iterations
browse   [  62% ] 0014/0300 VUs  27.8s/45s  200.00 iters/s
hook     [  62% ] 000/040 VUs    27.8s/45s  10.00 iters/s
pay      [  62% ] 049/200 VUs    27.8s/45s  50.00 iters/s

running (0m28.9s), 0064/0540 VUs, 7437 complete and 0 interrupted iterations
browse   [  64% ] 0014/0300 VUs  28.8s/45s  200.00 iters/s
hook     [  64% ] 000/040 VUs    28.8s/45s  10.00 iters/s
pay      [  64% ] 050/200 VUs    28.8s/45s  50.00 iters/s

running (0m29.9s), 0079/0540 VUs, 7682 complete and 0 interrupted iterations
browse   [  66% ] 0016/0300 VUs  29.8s/45s  200.00 iters/s
hook     [  66% ] 001/040 VUs    29.8s/45s  10.00 iters/s
pay      [  66% ] 062/200 VUs    29.8s/45s  50.00 iters/s

running (0m30.9s), 0076/0540 VUs, 7945 complete and 0 interrupted iterations
browse   [  69% ] 0016/0300 VUs  30.8s/45s  200.00 iters/s
hook     [  69% ] 001/040 VUs    30.8s/45s  10.00 iters/s
pay      [  69% ] 059/200 VUs    30.8s/45s  50.00 iters/s

running (0m31.9s), 0086/0540 VUs, 8195 complete and 0 interrupted iterations
browse   [  71% ] 0017/0300 VUs  31.8s/45s  200.00 iters/s
hook     [  71% ] 002/040 VUs    31.8s/45s  10.00 iters/s
pay      [  71% ] 067/200 VUs    31.8s/45s  50.00 iters/s

running (0m32.9s), 0084/0540 VUs, 8457 complete and 0 interrupted iterations
browse   [  73% ] 0016/0300 VUs  32.8s/45s  200.00 iters/s
hook     [  73% ] 001/040 VUs    32.8s/45s  10.00 iters/s
pay      [  73% ] 067/200 VUs    32.8s/45s  50.00 iters/s

running (0m33.9s), 0123/0540 VUs, 8677 complete and 0 interrupted iterations
browse   [  75% ] 0030/0300 VUs  33.8s/45s  200.00 iters/s
hook     [  75% ] 003/040 VUs    33.8s/45s  10.00 iters/s
pay      [  75% ] 090/200 VUs    33.8s/45s  50.00 iters/s

running (0m34.9s), 0119/0540 VUs, 8942 complete and 0 interrupted iterations
browse   [  77% ] 0029/0300 VUs  34.8s/45s  200.00 iters/s
hook     [  77% ] 002/040 VUs    34.8s/45s  10.00 iters/s
pay      [  77% ] 088/200 VUs    34.8s/45s  50.00 iters/s

running (0m35.9s), 0088/0540 VUs, 9233 complete and 0 interrupted iterations
browse   [  80% ] 0014/0300 VUs  35.8s/45s  200.00 iters/s
hook     [  80% ] 001/040 VUs    35.8s/45s  10.00 iters/s
pay      [  80% ] 073/200 VUs    35.8s/45s  50.00 iters/s

running (0m36.9s), 0080/0540 VUs, 9502 complete and 0 interrupted iterations
browse   [  82% ] 0015/0300 VUs  36.8s/45s  200.00 iters/s
hook     [  82% ] 001/040 VUs    36.8s/45s  10.00 iters/s
pay      [  82% ] 064/200 VUs    36.8s/45s  50.00 iters/s

running (0m37.9s), 0091/0540 VUs, 9750 complete and 0 interrupted iterations
browse   [  84% ] 0016/0300 VUs  37.8s/45s  200.00 iters/s
hook     [  84% ] 001/040 VUs    37.8s/45s  10.00 iters/s
pay      [  84% ] 074/200 VUs    37.8s/45s  50.00 iters/s

running (0m38.9s), 0075/0540 VUs, 10026 complete and 0 interrupted iterations
browse   [  86% ] 0016/0300 VUs  38.8s/45s  200.00 iters/s
hook     [  86% ] 001/040 VUs    38.8s/45s  10.00 iters/s
pay      [  86% ] 058/200 VUs    38.8s/45s  50.00 iters/s

running (0m39.9s), 0071/0540 VUs, 10290 complete and 0 interrupted iterations
browse   [  89% ] 0013/0300 VUs  39.8s/45s  200.00 iters/s
hook     [  89% ] 001/040 VUs    39.8s/45s  10.00 iters/s
pay      [  89% ] 057/200 VUs    39.8s/45s  50.00 iters/s

running (0m40.9s), 0078/0540 VUs, 10543 complete and 0 interrupted iterations
browse   [  91% ] 0016/0300 VUs  40.8s/45s  200.00 iters/s
hook     [  91% ] 001/040 VUs    40.8s/45s  10.00 iters/s
pay      [  91% ] 061/200 VUs    40.8s/45s  50.00 iters/s

running (0m41.9s), 0087/0540 VUs, 10794 complete and 0 interrupted iterations
browse   [  93% ] 0015/0300 VUs  41.8s/45s  200.00 iters/s
hook     [  93% ] 002/040 VUs    41.8s/45s  10.00 iters/s
pay      [  93% ] 070/200 VUs    41.8s/45s  50.00 iters/s

running (0m42.9s), 0071/0540 VUs, 11070 complete and 0 interrupted iterations
browse   [  95% ] 0017/0300 VUs  42.8s/45s  200.00 iters/s
hook     [  95% ] 001/040 VUs    42.8s/45s  10.00 iters/s
pay      [  95% ] 053/200 VUs    42.8s/45s  50.00 iters/s

running (0m43.9s), 0080/0540 VUs, 11322 complete and 0 interrupted iterations
browse   [  97% ] 0017/0300 VUs  43.8s/45s  200.00 iters/s
hook     [  97% ] 002/040 VUs    43.8s/45s  10.00 iters/s
pay      [  97% ] 061/200 VUs    43.8s/45s  50.00 iters/s

running (0m44.9s), 0066/0540 VUs, 11595 complete and 0 interrupted iterations
browse   [ 100% ] 0016/0300 VUs  44.8s/45s  200.00 iters/s
hook     [ 100% ] 000/040 VUs    44.8s/45s  10.00 iters/s
pay      [ 100% ] 050/200 VUs    44.8s/45s  50.00 iters/s

running (0m45.9s), 0027/0540 VUs, 11676 complete and 0 interrupted iterations
browse ✓ [ 100% ] 0000/0300 VUs  45s  200.00 iters/s
hook   ✓ [ 100% ] 000/040 VUs    45s  10.00 iters/s
pay    ↓ [ 100% ] 052/200 VUs    45s  50.00 iters/s


  █ THRESHOLDS 

    http_req_duration{name:confirm}
    ✓ 'p(95)<600000' p(95)=5.47s

    http_req_duration{name:webhook}
    ✓ 'p(95)<600000' p(95)=268.91ms


  █ TOTAL RESULTS 

    checks_total.......: 1       0.021332/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    ✓ login 200

    CUSTOM
    browse_2xx.....................: 5049   107.704261/s
    browse_503.....................: 3952   84.303276/s
    browse_ms......................: avg=80.47ms  med=47.3ms   max=980.16ms p(90)=243.58ms p(95)=310.97ms p(99)=423.38ms
    webhook_ms.....................: avg=99.21ms  med=73.24ms  max=600.98ms p(90)=193.01ms p(95)=268.91ms p(99)=423.49ms
    webhook_over_10s...............: 0.00%  0 out of 451

    HTTP
    http_req_duration..............: avg=253.78ms med=74.35ms  max=6.11s    p(90)=334.24ms p(95)=490.17ms p(99)=5.42s   
      { expected_response:true }...: avg=359.27ms med=91.86ms  max=6.11s    p(90)=323.34ms p(95)=522.07ms p(99)=5.53s   
      { name:confirm }.............: avg=1.13s    med=303.97ms max=6.11s    p(90)=5.32s    p(95)=5.47s    p(99)=5.72s   
      { name:webhook }.............: avg=99.21ms  med=73.24ms  max=600.98ms p(90)=193.01ms p(95)=268.91ms p(99)=423.49ms
    http_req_failed................: 41.87% 5843 out of 13955
    http_reqs......................: 13955  297.685278/s

    EXECUTION
    iteration_duration.............: avg=303.18ms med=74.49ms  max=6.38s    p(90)=418.88ms p(95)=693.04ms p(99)=5.56s   
    iterations.....................: 11703  249.646063/s
    vus............................: 27     min=27            max=121
    vus_max........................: 540    min=540           max=540

    NETWORK
    data_received..................: 26 MB  557 kB/s
    data_sent......................: 3.5 MB 75 kB/s



running (0m46.9s), 0000/0540 VUs, 11703 complete and 0 interrupted iterations
browse ✓ [ 100% ] 0000/0300 VUs  45s  200.00 iters/s
hook   ✓ [ 100% ] 000/040 VUs    45s  10.00 iters/s
pay    ✓ [ 100% ] 000/200 VUs    45s  50.00 iters/s